{
  "metadata": "Synthetic data generated by Mistral-7B-Instruct for 5 SetFit intents.",
  "training_data": [
    {
      "text": "We're a manufacturing company with 200 employees and an annual budget of $5 million.",
      "label": "score_lead_fit"
    },
    {
      "text": "Can you send me the information about the maintenance windows for our account?",
      "label": "collect_missing_info"
    },
    {
      "text": "I'd appreciate if you could share the details on the data retention policy for the service.",
      "label": "collect_missing_info"
    },
    {
      "text": "We are a fintech startup aiming to onboard thousands of users in the next year.",
      "label": "score_lead_fit"
    },
    {
      "text": "We're a growing agency with a team of 25 marketing professionals and an annual budget of $500k.",
      "label": "score_lead_fit"
    },
    {
      "text": "Could we negotiate the annual licensing fee for our company's needs?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I was contacted through an email campaign about your IoT solutions.",
      "label": "match_message_to_source"
    },
    {
      "text": "What is the exact process for escalating support tickets if we encounter issues outside of normal business hours?",
      "label": "collect_missing_info"
    },
    {
      "text": "I've been looking at 'Product X', they offer a more streamlined implementation process. Can we discuss expediting our implementation process?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I'd like to know the uptime percentage for your cloud service.",
      "label": "collect_missing_info"
    },
    {
      "text": "I'd appreciate if you could send me the pricing breakdown for the professional services package.",
      "label": "collect_missing_info"
    },
    {
      "text": "I'd like to know the exact number of seats included in the standard subscription.",
      "label": "collect_missing_info"
    },
    {
      "text": "I heard about your company through a webinar on B2B sales automation solutions that I attended.",
      "label": "match_message_to_source"
    },
    {
      "text": "Could you clarify the support hours for our account in the SLA?",
      "label": "collect_missing_info"
    },
    {
      "text": "I'm interested in your solutions after reading a whitepaper on your website about the benefits of your data migration service.",
      "label": "match_message_to_source"
    },
    {
      "text": "We're a fast-growing e-commerce company with a unique business model.",
      "label": "score_lead_fit"
    },
    {
      "text": "We're a software development company looking for a tool that fits our specific needs and budget.",
      "label": "score_lead_fit"
    },
    {
      "text": "Is it possible to have a meeting with the development team on Thursday at 11 AM my time?",
      "label": "handle_scheduling"
    },
    {
      "text": "I've observed that 'Vendor F' provides a free trial period extension for larger teams. Could we receive a similar offer for our company?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I'd appreciate it if we could set up a call with the support team for Tuesday at 5 PM PST.",
      "label": "handle_scheduling"
    },
    {
      "text": "We're a tech startup with a strong focus on AI and machine learning.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'd like to confirm the service level guarantees for the backup and recovery process.",
      "label": "collect_missing_info"
    },
    {
      "text": "We're a fast-growing edtech startup interested in a platform that can handle our expanding user base.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'm reaching out because I saw your company's name in a list of top cybersecurity providers from Gartner.",
      "label": "match_message_to_source"
    },
    {
      "text": "I need to check the response time for technical support tickets within our service agreement.",
      "label": "collect_missing_info"
    },
    {
      "text": "We are a media company with a team of 50+ professionals needing a robust platform for content management.",
      "label": "score_lead_fit"
    },
    {
      "text": "I was recommended by a colleague who has been using your cloud services.",
      "label": "match_message_to_source"
    },
    {
      "text": "Could we possibly move our meeting to next week, specifically on Wednesday at 2 PM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "Could you send me the details about the service level guarantees for data security?",
      "label": "collect_missing_info"
    },
    {
      "text": "Could you please provide the documentation for the API integration process?",
      "label": "collect_missing_info"
    },
    {
      "text": "I discovered your company through an ad on LinkedIn about your advanced CRM solutions.",
      "label": "match_message_to_source"
    },
    {
      "text": "I'd appreciate if you could share the specifics about the support hours for our account.",
      "label": "collect_missing_info"
    },
    {
      "text": "I'd like to schedule a 45-minute call with the product manager on Wednesday at 3 PM EST.",
      "label": "handle_scheduling"
    },
    {
      "text": "Can we arrange a 1-hour meeting with the technical team next Monday at 11 AM CET?",
      "label": "handle_scheduling"
    },
    {
      "text": "I've been comparing your product to 'Competitor Z'. They offer a more comprehensive reporting dashboard. Can we discuss adding this feature to your product?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I've noticed that 'Vendor J' offers a longer warranty period. Can we discuss extending the warranty period for our purchase?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We're a mid-sized manufacturing company looking for a tool to help us optimize our supply chain.",
      "label": "score_lead_fit"
    },
    {
      "text": "I've noticed that your product's pricing for larger teams isn't as competitive as 'Competitor W'. Could we discuss a more favorable pricing structure?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Could you tell me if there's any possibility to reduce the annual subscription fee for our company?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I'd appreciate if you could share the details on the customization options for the platform.",
      "label": "collect_missing_info"
    },
    {
      "text": "Can you clarify the data retention period in your compliance-focused solution?",
      "label": "collect_missing_info"
    },
    {
      "text": "Your pricing seems to be higher than 'Solution D'. Could we negotiate a better rate for our specific use case?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Could we set up a 30-minute call with the technical support team on Friday at 4 PM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "Is there any availability for a quick 15-minute call with the solutions architect on Thursday at 11 AM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "I found your website after clicking on a Google AdWords ad for your cloud services.",
      "label": "match_message_to_source"
    },
    {
      "text": "We're a healthcare provider looking to digitize our patient records.",
      "label": "score_lead_fit"
    },
    {
      "text": "We're a biotech company with 15 researchers and a monthly budget of $10k for new tools.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'd like to request a breakdown of the features included in the premium plan.",
      "label": "collect_missing_info"
    },
    {
      "text": "Your product seems to lack customization options compared to 'Solution D'. Could we discuss this further?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I read an article in Forbes about your blockchain-based solutions and wanted to know more.",
      "label": "match_message_to_source"
    },
    {
      "text": "I need to know the typical data processing time for our daily backups.",
      "label": "collect_missing_info"
    },
    {
      "text": "Could you please provide the average uptime for your services as stated in the SLA agreement?",
      "label": "collect_missing_info"
    },
    {
      "text": "We're a growing software company with a team of 30 engineers, and we need a platform that can support our growing needs.",
      "label": "score_lead_fit"
    },
    {
      "text": "We're a fast-growing company in the healthcare industry with 50 employees and a monthly budget of $10k.",
      "label": "score_lead_fit"
    },
    {
      "text": "Could we move our meeting to a later time this week?",
      "label": "handle_scheduling"
    },
    {
      "text": "I discovered your company through a LinkedIn ad about your advanced data management solutions.",
      "label": "match_message_to_source"
    },
    {
      "text": "We're a mid-sized retail company interested in a platform that can help us improve our inventory management.",
      "label": "score_lead_fit"
    },
    {
      "text": "We're a software development company with a team of 30 and a focus on scaling our development processes.",
      "label": "score_lead_fit"
    },
    {
      "text": "I came across your website after seeing a tweet about your AI-based predictive analytics.",
      "label": "match_message_to_source"
    },
    {
      "text": "I've seen that 'Competitor C' offers a more affordable annual pricing plan. Can we discuss a potential adjustment for our long-term contract?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Can you confirm the number of free trial days offered for new accounts?",
      "label": "collect_missing_info"
    },
    {
      "text": "I found your company through a Twitter post about your IoT platform.",
      "label": "match_message_to_source"
    },
    {
      "text": "I'd like to know the response time for security incident notifications in the SLA.",
      "label": "collect_missing_info"
    },
    {
      "text": "I discovered your company through a LinkedIn ad about your advanced data analytics services.",
      "label": "match_message_to_source"
    },
    {
      "text": "I found your company while researching for a reliable CRM solution on LinkedIn.",
      "label": "match_message_to_source"
    },
    {
      "text": "I'd appreciate it if we could reschedule our meeting for a later date.",
      "label": "handle_scheduling"
    },
    {
      "text": "We're a small but growing company in the tech industry, looking for a scalable solution that fits our budget.",
      "label": "score_lead_fit"
    },
    {
      "text": "Can you provide the pricing details for the additional storage option?",
      "label": "collect_missing_info"
    },
    {
      "text": "What is the typical response time for support requests during business hours?",
      "label": "collect_missing_info"
    },
    {
      "text": "I was directed to your company through a Google Adwords campaign for 'AI-powered marketing solutions'.",
      "label": "match_message_to_source"
    },
    {
      "text": "I'd like to know the uptime guarantee in the SLA for our contract.",
      "label": "collect_missing_info"
    },
    {
      "text": "We are a healthcare firm seeking a scalable solution to manage patient data securely and efficiently.",
      "label": "score_lead_fit"
    },
    {
      "text": "We are a pre-series A startup looking to improve our marketing automation. Is there a solution that fits our budget?",
      "label": "score_lead_fit"
    },
    {
      "text": "I need to see the SLA document for our contract to understand the service level guarantees.",
      "label": "collect_missing_info"
    },
    {
      "text": "We are a rapidly expanding retail chain with over 100 stores across the country.",
      "label": "score_lead_fit"
    },
    {
      "text": "I would like to reschedule our call to next Tuesday at 2 PM EST",
      "label": "handle_scheduling"
    },
    {
      "text": "Could you share the installation guide for the new API integration?",
      "label": "collect_missing_info"
    },
    {
      "text": "I've noticed that your product seems to lack real-time analytics. Is there a possibility to add this feature to your offering?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We are a SaaS company with a strong focus on cybersecurity solutions.",
      "label": "score_lead_fit"
    },
    {
      "text": "Our company is a growing retail chain interested in inventory management solutions.",
      "label": "score_lead_fit"
    },
    {
      "text": "We're a small but growing e-commerce business looking to streamline our operations.",
      "label": "score_lead_fit"
    },
    {
      "text": "We're a marketing agency with a team of 25 and a monthly budget of $10,000.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'd like to schedule a 30-minute call with the solutions architect on Friday at 10 AM EST.",
      "label": "handle_scheduling"
    },
    {
      "text": "We're a financial services firm interested in compliance and risk management solutions.",
      "label": "score_lead_fit"
    },
    {
      "text": "Our company is in the construction industry. Are there solutions tailored to our unique workflows?",
      "label": "score_lead_fit"
    },
    {
      "text": "I'm considering your solution, but 'Competitor W' offers a lower monthly cost per user. Can we discuss a potential price adjustment?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I've seen that 'Product Z' offers a longer free trial period. Could we negotiate a longer trial period for our evaluation?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I've been considering 'Competitor W', they offer a free training session for new users. Could we negotiate something similar?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We're a healthcare technology company looking to scale our operations with a monthly budget of $15,000.",
      "label": "score_lead_fit"
    },
    {
      "text": "We are a healthcare startup with a focus on telemedicine and remote patient monitoring.",
      "label": "score_lead_fit"
    },
    {
      "text": "Can you send me the detailed documentation for the software integration process?",
      "label": "collect_missing_info"
    },
    {
      "text": "I'd like to know the pricing breakdown for the enterprise plan.",
      "label": "collect_missing_info"
    },
    {
      "text": "Our company is in the education sector and we are looking to streamline our operations.",
      "label": "score_lead_fit"
    },
    {
      "text": "We are a consulting firm with a team of 20 professionals.",
      "label": "score_lead_fit"
    },
    {
      "text": "I discovered your company through a LinkedIn ad promoting your B2B SaaS solutions.",
      "label": "match_message_to_source"
    },
    {
      "text": "I'd like to request a demo for Wednesday at 1 PM PST if it's available.",
      "label": "handle_scheduling"
    },
    {
      "text": "We are a young edtech startup planning to scale rapidly. How does your platform fit our needs?",
      "label": "score_lead_fit"
    },
    {
      "text": "Could you please send me the user manual for the product we're considering?",
      "label": "collect_missing_info"
    },
    {
      "text": "I need to set up a call with the pre-sales team for next week.",
      "label": "handle_scheduling"
    },
    {
      "text": "What is the maximum number of users that can be added to the basic plan we're evaluating?",
      "label": "collect_missing_info"
    },
    {
      "text": "Can you provide the details on the scalability limits for the enterprise plan?",
      "label": "collect_missing_info"
    },
    {
      "text": "I've been looking at 'Competitor X', they offer a lower monthly rate for similar features. Can you match or beat their price?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I heard about your company through a webinar on your innovative cybersecurity offerings.",
      "label": "match_message_to_source"
    },
    {
      "text": "Is there availability for a webinar with the solutions architect on Wednesday at 1 PM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "We're a mid-sized manufacturing firm looking to improve efficiency.",
      "label": "score_lead_fit"
    },
    {
      "text": "We're a consulting firm that needs a solution to help us manage our projects more efficiently.",
      "label": "score_lead_fit"
    },
    {
      "text": "I was introduced to your company by a webinar on 'Data-Driven Decision Making'.",
      "label": "match_message_to_source"
    },
    {
      "text": "We're a small but rapidly expanding logistics company. Can your solution help us manage our growing business needs?",
      "label": "score_lead_fit"
    },
    {
      "text": "I need to know the specific limitations on the trial version of the product.",
      "label": "collect_missing_info"
    },
    {
      "text": "We're a small but fast-growing manufacturing company that needs a tool for efficient supply chain management.",
      "label": "score_lead_fit"
    },
    {
      "text": "Are there any discounts available for purchasing multiple licenses at once?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We're a healthcare startup with ambitious growth plans and a limited budget. Can your solution help?",
      "label": "score_lead_fit"
    },
    {
      "text": "I was reading an article on Forbes about your ERP system and decided to reach out for more information.",
      "label": "match_message_to_source"
    },
    {
      "text": "Please arrange a follow-up call with the sales team on Monday at 9 AM EST.",
      "label": "handle_scheduling"
    },
    {
      "text": "I came across your AI services after a friend recommended your company in a business networking event.",
      "label": "match_message_to_source"
    },
    {
      "text": "I represent a healthcare company with 50 employees. Are there industry-specific features available for us?",
      "label": "score_lead_fit"
    },
    {
      "text": "We're a fast-growing fintech company looking for a scalable solution that can cater to our unique compliance needs.",
      "label": "score_lead_fit"
    },
    {
      "text": "We are a small manufacturing company looking to improve our sales process with a new CRM system.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'd like to request a 60-minute meeting with the sales team next Monday at 9 AM PST.",
      "label": "handle_scheduling"
    },
    {
      "text": "I'd like to move forward with your product, but I was wondering if there are any volume discounts available for larger teams?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Could you provide the detailed specifications for the on-premises hardware solution?",
      "label": "collect_missing_info"
    },
    {
      "text": "I've noticed that competitor 'X' offers a longer free trial period. Is it possible to extend the trial period for our evaluation?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I'm considering your solution, but I've seen that 'Competitor R' offers a longer contract term. Can we negotiate a longer contract for a better price?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I need to know the exact uptime guarantee in the service level agreement for our account.",
      "label": "collect_missing_info"
    },
    {
      "text": "What are the details on the service credits for breached SLAs?",
      "label": "collect_missing_info"
    },
    {
      "text": "I've seen that 'Solution I' offers a lower cost per user for larger teams. Can we discuss a volume discount for our company?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We are a logistics company looking to automate our operations and improve our customer service.",
      "label": "score_lead_fit"
    },
    {
      "text": "Can you confirm the SLA for data recovery in the event of a service interruption?",
      "label": "collect_missing_info"
    },
    {
      "text": "What is the pricing structure for the advanced integration options?",
      "label": "collect_missing_info"
    },
    {
      "text": "I found your website through a Google search for 'B2B data analytics providers'.",
      "label": "match_message_to_source"
    },
    {
      "text": "We are a mid-sized company with a strong growth trajectory and a focus on data-driven decisions.",
      "label": "score_lead_fit"
    },
    {
      "text": "I need to know the specifics about the scalability options available in the premium plan.",
      "label": "collect_missing_info"
    },
    {
      "text": "We're a B2B e-commerce company looking for a platform that can help us streamline our supply chain management.",
      "label": "score_lead_fit"
    },
    {
      "text": "Could you check if we can have a 45-minute discussion with the solutions team on Monday at 4 PM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "I noticed that 'Product E' offers a more flexible pricing plan. Could we have a similar arrangement?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I've noticed that your product lacks a mobile app, which is a key feature for our team. Can you develop this feature in the near future?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I attended a trade show where I learned about your IoT platform and its capabilities.",
      "label": "match_message_to_source"
    },
    {
      "text": "I need to set up a 45-minute meeting with the implementation team for next Thursday at 10 AM PST",
      "label": "handle_scheduling"
    },
    {
      "text": "I would like to schedule a call with the sales team for next Tuesday at 2 PM PST.",
      "label": "handle_scheduling"
    },
    {
      "text": "I've observed that 'Solution V' offers additional integrations that would benefit our team. Are there any plans to add these integrations to your product?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We're a fintech startup looking for a tool that can help us securely manage our customer data.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'd like to book a meeting with the engineering team for Friday morning.",
      "label": "handle_scheduling"
    },
    {
      "text": "We're a manufacturing company with 100 employees and an annual budget of $1M for new tools.",
      "label": "score_lead_fit"
    },
    {
      "text": "I've noticed that 'Competitor X' offers a more affordable pricing plan. Could we discuss potential price reductions for our subscription?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I'm here because I saw a banner ad on Gartner for your predictive analytics services.",
      "label": "match_message_to_source"
    },
    {
      "text": "I've seen that 'Product K' offers a more flexible payment plan. Can we discuss a payment plan that suits our financial needs?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Could we arrange a call with the product specialist on Tuesday at 11 AM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "We are a fintech company with a strong focus on data security and compliance.",
      "label": "score_lead_fit"
    },
    {
      "text": "We're a fast-growing cybersecurity startup with a monthly budget of $2,500 and plans to double our team in the next year.",
      "label": "score_lead_fit"
    },
    {
      "text": "I've observed that 'Solution F' offers a free trial without a credit card. Can we do the same?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "The initial setup fee seems high. Are there any discounts or waivers available for a larger implementation?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I'm intrigued by your offering, but I've heard that 'Product T' has a more user-friendly interface. Is there a possibility to enhance the user experience?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I'm contacting you because I received a direct mailer about your ERP solutions.",
      "label": "match_message_to_source"
    },
    {
      "text": "Your product seems to lack the ability to integrate with our existing systems, can this be addressed?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I was referred to your company by a business partner who uses your supply chain management solution.",
      "label": "match_message_to_source"
    },
    {
      "text": "We're a healthcare firm seeking a solution that can securely manage our sensitive data.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'm interested in your offering, but I've noticed that 'Competitor Z' offers a longer support response time. Can we improve that for your product?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "What is the pricing breakdown for the advanced analytics features?",
      "label": "collect_missing_info"
    },
    {
      "text": "Can you provide the details on the scalability options for the enterprise plan?",
      "label": "collect_missing_info"
    },
    {
      "text": "I need to confirm the response time for support tickets within the SLA.",
      "label": "collect_missing_info"
    },
    {
      "text": "Can we reschedule our meeting from Wednesday to Thursday at 10 AM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "I was directed to your platform by a Twitter post about your AI capabilities.",
      "label": "match_message_to_source"
    },
    {
      "text": "We're a mid-sized manufacturing firm looking for a B2B solution that can accommodate our growth plans.",
      "label": "score_lead_fit"
    },
    {
      "text": "Could you provide the details on the security measures implemented for data protection?",
      "label": "collect_missing_info"
    },
    {
      "text": "Is it possible to schedule a webinar for our team on Wednesday at 2 PM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "Is there a possibility to extend the trial period for our team to fully evaluate the product's capabilities?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Can we arrange a quick 15-minute call for tomorrow afternoon at 3 PM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "We're a medium-sized e-commerce business looking for a B2B platform that can handle our growing user base.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'd like to arrange a 60-minute meeting with the product specialist on Tuesday at 2 PM PST.",
      "label": "handle_scheduling"
    },
    {
      "text": "Could we schedule a call with the technical expert for Monday at 11 AM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "We are a financial services firm with a need for a scalable solution to manage client data.",
      "label": "score_lead_fit"
    },
    {
      "text": "Can you share the pricing breakdown for the professional services package?",
      "label": "collect_missing_info"
    },
    {
      "text": "I'd like to request a meeting with the product specialist for next Friday at 4 PM MST",
      "label": "handle_scheduling"
    },
    {
      "text": "We are a manufacturing company looking to streamline our sales processes and improve customer retention.",
      "label": "score_lead_fit"
    },
    {
      "text": "We're a startup in the renewable energy sector and we're looking for a scalable solution to manage our data.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'm interested in your product, but I've noticed that 'Competitor U' offers a more robust set of features. Can we discuss a feature upgrade or customization?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Can you send me the user guide for the advanced analytics module?",
      "label": "collect_missing_info"
    },
    {
      "text": "Could you find a slot for a 60-minute presentation this coming Thursday?",
      "label": "handle_scheduling"
    },
    {
      "text": "Your annual contract seems expensive, especially when compared to 'Solution Y'. Are there any discounts for longer commitment periods?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "As a financial services company, we need a platform that can handle high-volume data and meet our strict compliance requirements.",
      "label": "score_lead_fit"
    },
    {
      "text": "I need to verify the scalability limits of the enterprise plan.",
      "label": "collect_missing_info"
    },
    {
      "text": "I'd like to know the uptime percentage guaranteed in the service level agreement for the solution we're considering.",
      "label": "collect_missing_info"
    },
    {
      "text": "I'm concerned about the monthly cost per user for your product. Are there any volume discounts available for our large team?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I'd like to discuss a custom pricing plan based on our specific usage and needs.",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Is it possible to schedule a call with the technical team for Tuesday at 2 PM PST?",
      "label": "handle_scheduling"
    },
    {
      "text": "Our company is a leading player in the renewable energy sector.",
      "label": "score_lead_fit"
    },
    {
      "text": "I've noticed that our competitor 'X' offers a free training session, is this something you could provide?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We're a mid-sized company looking to streamline our operations and boost productivity.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'd like to request a copy of the security compliance documentation.",
      "label": "collect_missing_info"
    },
    {
      "text": "I've noticed that 'Product Z' offers a more comprehensive data analysis tool. Could we discuss integrating that feature into your product?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I need to know the uptime guarantee for the enterprise plan we're considering.",
      "label": "collect_missing_info"
    },
    {
      "text": "We're a fast-growing real estate company looking for a tool to help us manage our properties more efficiently.",
      "label": "score_lead_fit"
    },
    {
      "text": "I've observed that 'Solution V' offers a more comprehensive training program. Can we enhance the training resources for your product?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Can we schedule a 45-minute call with the account manager for Wednesday at 2 PM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "We're a small but growing software development firm with a limited budget. Can your solution help us manage our growing business needs?",
      "label": "score_lead_fit"
    },
    {
      "text": "Please schedule a meeting with the support team for next Friday at 10 AM EST.",
      "label": "handle_scheduling"
    },
    {
      "text": "I need to know the average downtime in the last quarter.",
      "label": "collect_missing_info"
    },
    {
      "text": "We're a small but expanding construction company with a limited budget. Can your solution help us manage our growing business needs?",
      "label": "score_lead_fit"
    },
    {
      "text": "I've noticed that 'Service G' offers a dedicated account manager for all customers. Is there a possibility to have this for our company?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Could you please provide me with the documentation for the integration process with our existing system?",
      "label": "collect_missing_info"
    },
    {
      "text": "Could you provide the response time for emergency support requests as stated in the SLA?",
      "label": "collect_missing_info"
    },
    {
      "text": "Can we arrange a meeting with the product specialist on Monday at 11 AM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "We've observed that 'Competitor Z' offers a dedicated account manager, could this be a possibility for our company?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I've noticed that 'Competitor W' provides a dedicated account manager. Can we discuss adding this feature for your product?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I was directed to your company by a Google search for 'B2B cybersecurity solutions'.",
      "label": "match_message_to_source"
    },
    {
      "text": "Our company is in the agriculture sector and we need a platform that can handle our large data sets.",
      "label": "score_lead_fit"
    },
    {
      "text": "I've noticed that 'Solution T' offers integration with more third-party tools. Can we discuss adding more integrations to your product?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I'd like to request a reduction in the setup fee for our project. Is this something that can be negotiated?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "What is the average downtime for maintenance in the Gold Support package?",
      "label": "collect_missing_info"
    },
    {
      "text": "Could you provide the details on the service level agreement for the advanced analytics module?",
      "label": "collect_missing_info"
    },
    {
      "text": "We are a software development company with a focus on building scalable solutions for our clients.",
      "label": "score_lead_fit"
    },
    {
      "text": "I need the details on the data migration process for our account.",
      "label": "collect_missing_info"
    },
    {
      "text": "Your product seems to lack a robust customer support system. Is there a plan that includes 24/7 support like 'Provider H' offers?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I'm reaching out because I saw a Google ad about your data visualization tools.",
      "label": "match_message_to_source"
    },
    {
      "text": "I'd like to arrange a demo with the marketing team on Thursday at 3 PM PST.",
      "label": "handle_scheduling"
    },
    {
      "text": "I'd like to know the maximum number of users that can be supported under the premium plan.",
      "label": "collect_missing_info"
    },
    {
      "text": "The onboarding process seems complex for your product. Is there a possibility to simplify it or offer additional resources during implementation?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Is it possible to reschedule our meeting to Wednesday at 10 AM my time?",
      "label": "handle_scheduling"
    },
    {
      "text": "We are in the manufacturing industry and are looking for a solution to streamline our supply chain.",
      "label": "score_lead_fit"
    },
    {
      "text": "We are a rapidly growing e-commerce business looking to optimize our marketing efforts.",
      "label": "score_lead_fit"
    },
    {
      "text": "We've been using a similar solution, but it offers a lower monthly cost. Can you match or beat that price for our contract?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We were hoping for a longer trial period for a more comprehensive evaluation of your product. Is this possible?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Your product seems to be missing the customization features that 'Solution Y' provides. Can we negotiate adding these capabilities?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We're a marketing agency looking to optimize our client's digital marketing strategies.",
      "label": "score_lead_fit"
    },
    {
      "text": "Your product seems to lack the real-time analytics feature that 'Competitor Y' offers. Is there a possibility to add this functionality?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I see that 'Competitor C' provides unlimited users for the same price. Can we get the same offer?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Can you provide me with the contact details for the technical support team?",
      "label": "collect_missing_info"
    },
    {
      "text": "I've observed that 'Solution A' offers a waived setup fee for initial implementation. Is this something you can offer for our company?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I'm here because I saw your company's name in a list of top B2B solutions providers in a Business Insider article.",
      "label": "match_message_to_source"
    },
    {
      "text": "I came across your company while researching the best CRM solutions for my business.",
      "label": "match_message_to_source"
    },
    {
      "text": "I've noticed that 'Solution C' offers a more flexible pricing plan, could we discuss a similar arrangement?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Can you send me the user manual for the new software update?",
      "label": "collect_missing_info"
    },
    {
      "text": "Can we schedule a 60-minute call with the implementation team on Thursday at 10 AM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "Is there any discount available for a multi-year contract?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Could you please send me the latest version of the user manual for the software?",
      "label": "collect_missing_info"
    },
    {
      "text": "I learned about your company from a podcast episode on 'Innovative Data Solutions'.",
      "label": "match_message_to_source"
    },
    {
      "text": "I was introduced to your company through a seminar about your enterprise software suite.",
      "label": "match_message_to_source"
    },
    {
      "text": "I've noticed that your product lacks customizable reporting options. Can we discuss this further?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We're a small but expanding law firm with a budget for a B2B solution that can help us streamline our operations.",
      "label": "score_lead_fit"
    },
    {
      "text": "We're a rapidly growing e-commerce company with 50 employees and a monthly budget of $10,000.",
      "label": "score_lead_fit"
    },
    {
      "text": "I've observed that 'Service L' offers a more extensive library of training materials. Can we have access to additional resources for our team?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We're a professional services firm looking for a cost-effective solution to streamline our workflow.",
      "label": "score_lead_fit"
    },
    {
      "text": "Our company is looking to streamline our operations with a scalable solution.",
      "label": "score_lead_fit"
    },
    {
      "text": "We are a growing software development company with a team of 30. Are there scalable solutions available for us?",
      "label": "score_lead_fit"
    },
    {
      "text": "I've noticed that 'Product E' offers a more comprehensive onboarding service. Can we discuss a more personalized approach for our team?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I was referred to your service by a partner company that mentioned your excellent data security solutions.",
      "label": "match_message_to_source"
    },
    {
      "text": "Our company is in the agriculture industry. Can your platform help us optimize our crop yield data?",
      "label": "score_lead_fit"
    },
    {
      "text": "We are a tech startup developing AI-based solutions for the agriculture industry.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'd like to know the scalability limits for the premium plan we're considering.",
      "label": "collect_missing_info"
    },
    {
      "text": "We are a consulting firm specializing in supply chain optimization and seeking a tool to enhance our services.",
      "label": "score_lead_fit"
    },
    {
      "text": "I've found that 'Solution C' offers a more affordable pricing plan for teams with a larger number of users. Can we discuss a similar plan for our company?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We are a software development company with a team of 30 developers.",
      "label": "score_lead_fit"
    },
    {
      "text": "Could you please provide the system uptime data for the past month?",
      "label": "collect_missing_info"
    },
    {
      "text": "I'm reaching out because I saw a tweet about your B2B software from a thought leader in my industry.",
      "label": "match_message_to_source"
    },
    {
      "text": "I'm considering 'Solution Z' as well, which offers a longer trial period. Could we negotiate an extended trial period for our evaluation?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I saw a video on YouTube about your cloud-based customer service platform and wanted to learn more.",
      "label": "match_message_to_source"
    },
    {
      "text": "We're a new B2B SaaS company in the cybersecurity space seeking a robust solution.",
      "label": "score_lead_fit"
    },
    {
      "text": "I've observed that 'Competitor R' offers a more extensive API library. Can we discuss expanding the API capabilities for your product?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Could you send me the pricing breakdown for the enterprise package, including any additional fees?",
      "label": "collect_missing_info"
    },
    {
      "text": "We've been considering your solution, but the setup fee seems quite high. Can we negotiate a lower fee for our company?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I've been evaluating your product, but I'm concerned about the ongoing maintenance costs. Can these be reduced for our company?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Is there a possibility to lower the one-time implementation cost for our project?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We are a non-profit organization looking for a solution to manage our volunteer scheduling. Are there special rates available for us?",
      "label": "score_lead_fit"
    },
    {
      "text": "I need to reschedule our meeting from next week to this coming Thursday at 1 PM EST.",
      "label": "handle_scheduling"
    },
    {
      "text": "We're a fintech startup with a team of 5 and a monthly budget of $1,500.",
      "label": "score_lead_fit"
    },
    {
      "text": "I need to know the average resolution time for support tickets within the service level agreement.",
      "label": "collect_missing_info"
    },
    {
      "text": "What are the system requirements for the cloud service we're considering?",
      "label": "collect_missing_info"
    },
    {
      "text": "I was interested in your services after reading a review on Gartner.",
      "label": "match_message_to_source"
    },
    {
      "text": "We are a media company with a monthly budget of $2,000 for new software solutions.",
      "label": "score_lead_fit"
    },
    {
      "text": "I need to schedule a call with the implementation team for next Monday at 10 AM EST.",
      "label": "handle_scheduling"
    },
    {
      "text": "Could you send me the whitepaper on the security measures implemented in your solution?",
      "label": "collect_missing_info"
    },
    {
      "text": "I was intrigued by a Facebook post promoting your ERP software and decided to reach out.",
      "label": "match_message_to_source"
    },
    {
      "text": "We're a fast-growing software development company with a team of 75 and a monthly budget of $25,000.",
      "label": "score_lead_fit"
    },
    {
      "text": "I've seen that 'Competitor Y' offers a 24/7 customer support, do you provide that as well?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I'm interested in your product, but I've heard that 'Solution Y' provides better support. Is there a way to improve the support we would receive from your team?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I've noticed that 'Solution B' offers a dedicated account manager. Could we discuss adding this service to our package?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I was intrigued by your product after reading a review on TechCrunch.",
      "label": "match_message_to_source"
    },
    {
      "text": "Could we negotiate the pricing for the additional training and support services?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We're a media company with a team of 50 journalists and a monthly budget of $5k for new tools.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'd like to confirm a meeting with the CTO for next Tuesday at 2 PM EST.",
      "label": "handle_scheduling"
    },
    {
      "text": "We're a renewable energy company with a team of 100 and a monthly budget of $20,000.",
      "label": "score_lead_fit"
    },
    {
      "text": "We are a medium-sized law firm interested in a case management system. Can we discuss pricing options?",
      "label": "score_lead_fit"
    },
    {
      "text": "I need to know the average uptime percentage for your service.",
      "label": "collect_missing_info"
    },
    {
      "text": "I need to know the average resolution time for technical issues within the service level agreement.",
      "label": "collect_missing_info"
    },
    {
      "text": "We're a retail business with multiple locations and an annual revenue of over $5M.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'm interested in the service level guarantees for the support team's response times.",
      "label": "collect_missing_info"
    },
    {
      "text": "Your pricing model seems to be less flexible compared to 'Competitor U'. Can we discuss alternative payment plans or a more flexible pricing structure?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I heard about your company from a webinar on the latest trends in cloud services.",
      "label": "match_message_to_source"
    },
    {
      "text": "I was referred to you by a colleague who read about your blockchain solutions in a Forbes article.",
      "label": "match_message_to_source"
    },
    {
      "text": "We're an e-commerce startup that has been growing steadily and is looking for a robust solution.",
      "label": "score_lead_fit"
    },
    {
      "text": "I saw a webinar about your AI-powered marketing automation platform and was impressed.",
      "label": "match_message_to_source"
    },
    {
      "text": "I learned about your company from a whitepaper I downloaded on your website about AI-driven supply chain management.",
      "label": "match_message_to_source"
    },
    {
      "text": "We are a consulting firm specializing in business process automation and optimization.",
      "label": "score_lead_fit"
    },
    {
      "text": "We are a logistics company looking to improve our supply chain management.",
      "label": "score_lead_fit"
    },
    {
      "text": "I need to confirm a demo on Friday at 4 PM my time.",
      "label": "handle_scheduling"
    },
    {
      "text": "I'd appreciate it if we could schedule a follow-up meeting with the account manager on Wednesday at 10 AM EST.",
      "label": "handle_scheduling"
    },
    {
      "text": "We're a logistics company looking for a solution to manage our fleet more efficiently.",
      "label": "score_lead_fit"
    },
    {
      "text": "I've noticed that competitor 'X' offers a lower monthly cost for a similar package. Can we discuss a more competitive rate?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Could you share the documentation on the data migration process?",
      "label": "collect_missing_info"
    },
    {
      "text": "Could you please send me the latest version of the product datasheets?",
      "label": "collect_missing_info"
    },
    {
      "text": "The cost of your add-on features seems high. Are there any bundles or packages that can lower our overall costs?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Could we arrange a 60-minute meeting with the product specialist next Monday at 11 AM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "Could you send the documentation for the advanced analytics module?",
      "label": "collect_missing_info"
    },
    {
      "text": "Our organization has a monthly budget of $10k for software tools to improve productivity.",
      "label": "score_lead_fit"
    },
    {
      "text": "I've noticed that 'Product G' offers more storage space for the same price. Can we have more storage included in our plan?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I've been considering your solution, but I've noticed that 'Competitor X' offers a more cost-effective solution. Can we discuss a potential price reduction?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "Can we reschedule our meeting from Wednesday to Thursday at 10 AM EST?",
      "label": "handle_scheduling"
    },
    {
      "text": "We're a mid-sized consulting firm with a focus on growth and a monthly budget of $7,500.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'd appreciate if you could send the documentation for the custom reporting functionality.",
      "label": "collect_missing_info"
    },
    {
      "text": "What is the typical turnaround time for software updates and patches?",
      "label": "collect_missing_info"
    },
    {
      "text": "I'd like to schedule a call with the executive team next week. Any availability?",
      "label": "handle_scheduling"
    },
    {
      "text": "I'd appreciate if you could share the details on the integration with third-party tools.",
      "label": "collect_missing_info"
    },
    {
      "text": "I was referred by a professional network group that mentioned your ERP software.",
      "label": "match_message_to_source"
    },
    {
      "text": "I've been considering your cloud solutions after reading the success story on Forbes.",
      "label": "match_message_to_source"
    },
    {
      "text": "What are the specific system requirements for the enterprise solution?",
      "label": "collect_missing_info"
    },
    {
      "text": "We are a growing e-commerce business with a focus on expanding our customer base.",
      "label": "score_lead_fit"
    },
    {
      "text": "We're a growing e-learning platform seeking a tool to help us manage and scale our content effectively.",
      "label": "score_lead_fit"
    },
    {
      "text": "I was directed to your platform by a colleague who recommended your marketing automation tools.",
      "label": "match_message_to_source"
    },
    {
      "text": "I need to verify the data retention period in the backup and recovery process.",
      "label": "collect_missing_info"
    },
    {
      "text": "I found your company in a list of top B2B data management providers.",
      "label": "match_message_to_source"
    },
    {
      "text": "We're a tech startup with a team of 20 developers, and we're looking for a scalable solution to manage our projects.",
      "label": "score_lead_fit"
    },
    {
      "text": "I need to confirm the date and time for our demo session.",
      "label": "handle_scheduling"
    },
    {
      "text": "We are a fast-growing e-commerce company with a monthly revenue of $100,000.",
      "label": "score_lead_fit"
    },
    {
      "text": "I was recommended to your company by a colleague who uses your project management tool.",
      "label": "match_message_to_source"
    },
    {
      "text": "I've observed that 'Solution A' offers a scalable solution for growing businesses. Can we discuss options for future growth with your product?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We are a healthcare startup with a strong potential for growth.",
      "label": "score_lead_fit"
    },
    {
      "text": "I'd like to request a breakdown of the pricing for the additional user licenses.",
      "label": "collect_missing_info"
    },
    {
      "text": "I was referred by a colleague who read about your AI services in Information Age.",
      "label": "match_message_to_source"
    },
    {
      "text": "Could you explain how your product can help us streamline our e-commerce operations?",
      "label": "score_lead_fit"
    },
    {
      "text": "Is there any room for negotiation on the contract duration or setup fee?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "I need to set up a 30-minute demo for this coming Thursday at 11 AM GMT",
      "label": "handle_scheduling"
    },
    {
      "text": "I was reading a blog post about your company's IoT services on TechCrunch and thought it would be a good fit for our needs.",
      "label": "match_message_to_source"
    },
    {
      "text": "I've been evaluating several solutions, and I've found that 'Competitor Y' offers real-time data analysis. Can your product provide this feature?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We are a construction company looking to optimize our project management.",
      "label": "score_lead_fit"
    },
    {
      "text": "We are a software development company with a team of 15 engineers.",
      "label": "score_lead_fit"
    },
    {
      "text": "I need to confirm the date and time for our follow-up call.",
      "label": "handle_scheduling"
    },
    {
      "text": "Is it possible to have a 60-minute meeting with the sales team this coming Wednesday at 9 AM CET?",
      "label": "handle_scheduling"
    },
    {
      "text": "I'd like to schedule a call with the account manager for next Tuesday at 2 PM GMT+2",
      "label": "handle_scheduling"
    },
    {
      "text": "I need to confirm the data retention policy for our account.",
      "label": "collect_missing_info"
    },
    {
      "text": "I came across your services after seeing a sponsored ad on Facebook about your data analytics solutions.",
      "label": "match_message_to_source"
    },
    {
      "text": "Let's set up a call with the sales team for Thursday at 3 PM EST.",
      "label": "handle_scheduling"
    },
    {
      "text": "I've found that 'Solution A' offers a more flexible pricing model for larger teams. Can we adjust your pricing to better accommodate our needs?",
      "label": "adjust_offer_positioning"
    },
    {
      "text": "We're a B2B SaaS company seeking a scalable solution that can handle our increasing user base.",
      "label": "score_lead_fit"
    },
    {
      "text": "Our company operates in the healthcare industry and needs a scalable solution for patient data management.",
      "label": "score_lead_fit"
    },
    {
      "text": "We are a manufacturing firm with a monthly budget of $10,000 for new tools.",
      "label": "score_lead_fit"
    },
    {
      "text": "We're a startup in the renewable energy sector with a limited budget but high growth potential. Is your solution suitable?",
      "label": "score_lead_fit"
    },
    {
      "text": "We are a mid-sized company with 50 employees and a strong growth trajectory.",
      "label": "score_lead_fit"
    },
    {
      "text": "Could we possibly do a 45-minute meeting on Wednesday at 10 AM PST?",
      "label": "handle_scheduling"
    },
    {
      "text": "We're a media company looking for a tool that can help us manage and analyze our content more effectively.",
      "label": "score_lead_fit"
    },
    {
      "text": "I was referred by a friend who mentioned your cutting-edge SaaS solutions in a conversation.",
      "label": "match_message_to_source"
    }
  ]
}